In [1]:
import pandas as pd

In [2]:
empty_df = pd.DataFrame()

In [3]:
print (empty_df)

Empty DataFrame
Columns: []
Index: []

In [4]:
continents_name = ['Asia', 
                   'Africa', 
                   'North America', 
                   'South America',
                   'Antarctica', 
                   'Europe', 
                   'Australia']

In [5]:
name_df = pd.DataFrame(continents_name, columns = ['Name'])
name_df

            Name
0           Asia
1         Africa
2  North America
3  South America
4     Antarctica
5         Europe
6      Australia

In [6]:
continents_area = [44579000, 
                   30370000, 
                   24709000, 
                   17840000, 
                   14000000, 
                   10180000, 
                   8600000]

In [7]:
continents_area_msqkm = []

In [8]:
for i in continents_area:
    continents_area_msqkm.append(i/(10**6))

In [9]:
area_df = pd.DataFrame(continents_area_msqkm, columns = ['Area (MSqkm)'])
area_df

   Area (MSqkm)
0        44.579
1        30.370
2        24.709
3        17.840
4        14.000
5        10.180
6         8.600

In [10]:
continents_name_area = list(zip(continents_name, continents_area_msqkm))
continents_name_area

[('Asia', 44.579),
 ('Africa', 30.37),
 ('North America', 24.709),
 ('South America', 17.84),
 ('Antarctica', 14.0),
 ('Europe', 10.18),
 ('Australia', 8.6)]

In [11]:
continents_name_area_1 = pd.DataFrame(continents_name_area,
                                      columns = ['Name', 'Area (MSqkm)'])
continents_name_area_1

            Name  Area (MSqkm)
0           Asia        44.579
1         Africa        30.370
2  North America        24.709
3  South America        17.840
4     Antarctica        14.000
5         Europe        10.180
6      Australia         8.600

In [12]:
weather_data = pd.read_csv("datasets/weather_data.csv")
weather_data

        day  temperature  windspeed  event
0  1/1/2017           32          6   Rain
1  1/2/2017           35          7  Sunny
2  1/3/2017           28          2   Snow
3  1/4/2017           24          7   Snow
4  1/5/2017           32          4   Rain
5  1/6/2017           31          2  Sunny

In [13]:
weather_data.shape

(6, 4)

In [14]:
rows,columns = weather_data.shape

In [15]:
rows

6

In [16]:
columns

4

In [17]:
weather_data.head()

        day  temperature  windspeed  event
0  1/1/2017           32          6   Rain
1  1/2/2017           35          7  Sunny
2  1/3/2017           28          2   Snow
3  1/4/2017           24          7   Snow
4  1/5/2017           32          4   Rain

In [18]:
weather_data.head(3)

        day  temperature  windspeed  event
0  1/1/2017           32          6   Rain
1  1/2/2017           35          7  Sunny
2  1/3/2017           28          2   Snow

In [19]:
weather_data.tail()

        day  temperature  windspeed  event
1  1/2/2017           35          7  Sunny
2  1/3/2017           28          2   Snow
3  1/4/2017           24          7   Snow
4  1/5/2017           32          4   Rain
5  1/6/2017           31          2  Sunny

In [20]:
weather_data.tail(2)

        day  temperature  windspeed  event
4  1/5/2017           32          4   Rain
5  1/6/2017           31          2  Sunny

In [21]:
weather_data[3:5]

        day  temperature  windspeed event
3  1/4/2017           24          7  Snow
4  1/5/2017           32          4  Rain

In [22]:
weather_data.columns

Index(['day', 'temperature', 'windspeed', 'event'], dtype='object')

In [23]:
weather_data.day

0    1/1/2017
1    1/2/2017
2    1/3/2017
3    1/4/2017
4    1/5/2017
5    1/6/2017
Name: day, dtype: object

In [24]:
weather_data['day']

0    1/1/2017
1    1/2/2017
2    1/3/2017
3    1/4/2017
4    1/5/2017
5    1/6/2017
Name: day, dtype: object

In [25]:
weather_data.windspeed

0    6
1    7
2    2
3    7
4    4
5    2
Name: windspeed, dtype: int64

In [26]:
weather_data['temperature'].max()

35

In [27]:
weather_data['windspeed'].min()

2

In [28]:
weather_data.describe()

       temperature  windspeed
count     6.000000   6.000000
mean     30.333333   4.666667
std       3.829708   2.338090
min      24.000000   2.000000
25%      28.750000   2.500000
50%      31.500000   5.000000
75%      32.000000   6.750000
max      35.000000   7.000000

In [29]:
weather_data.describe(include = 'all')

             day  temperature  windspeed  event
count          6     6.000000   6.000000      6
unique         6          NaN        NaN      3
top     1/1/2017          NaN        NaN  Sunny
freq           1          NaN        NaN      2
mean         NaN    30.333333   4.666667    NaN
std          NaN     3.829708   2.338090    NaN
min          NaN    24.000000   2.000000    NaN
25%          NaN    28.750000   2.500000    NaN
50%          NaN    31.500000   5.000000    NaN
75%          NaN    32.000000   6.750000    NaN
max          NaN    35.000000   7.000000    NaN

In [30]:
weather_data.describe(exclude = None)

       temperature  windspeed
count     6.000000   6.000000
mean     30.333333   4.666667
std       3.829708   2.338090
min      24.000000   2.000000
25%      28.750000   2.500000
50%      31.500000   5.000000
75%      32.000000   6.750000
max      35.000000   7.000000